patchew-project/qemu/hw/mips/pic32mk_canfd.c
/*
 * Microchip PIC32MK CAN FD controller emulation
 * Based on PIC32MK GPK/MCM with CAN FD Family Datasheet (DS60001519E)
 * and Microchip CAN FD Controller Reference Manual (DS60001507).
 *
 * Implements:
 *  - Two MemoryRegions per instance: SFR block + Message RAM
 *  - Operating mode transitions (Config / Normal / Internal Loopback / others)
 *  - TX Queue (TXQ) and up to 31 configurable FIFOs
 *  - UINC pointer-advance protocol (head/tail management)
 *  - Internal loopback: TX → acceptance filter → RX FIFO
 *  - CiINT two-level interrupt aggregator → single EVIC IRQ line
 *  - 32 acceptance filters with mask
 *  - SET/CLR/INV register aliasing for key registers
 *
 * Not yet implemented:
 *  - CiFIFOBA register (message RAM base set by firmware; needed for
 *    Harmony3-generated drivers that call CFD1FIFOBA = KVA_TO_PA(buf))
 *  - TEF (TX Event FIFO) population on TX complete
 *  - CiTBC free-running counter (timestamp)
 *
 * Copyright (c) 2026 QEMU contributors
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/units.h"
#include "qapi/error.h"
#include "hw/core/qdev-properties.h"
#include "hw/core/sysbus.h"
#include "hw/core/irq.h"
#include "hw/mips/pic32mk.h"
#include "hw/mips/pic32mk_canfd.h"

/*
 * DLC / PLSIZE helpers
 * -----------------------------------------------------------------------
 */

static const uint8_t dlc_to_bytes_fd[16] = {
    0, 1, 2, 3, 4, 5, 6, 7, 8, 12, 16, 20, 24, 32, 48, 64
};

static uint8_t canfd_dlc_bytes(uint8_t dlc, bool fdf)
{
    if (dlc > 8 && !fdf) {
        return 8;
    }
    return dlc_to_bytes_fd[dlc & 0xF];
}

/* PLSIZE field → payload bytes */
static const uint8_t plsize_to_bytes[8] = { 8, 12, 16, 20, 24, 32, 48, 64 };

static uint32_t canfd_obj_size(uint32_t fifocon)
{
    uint8_t plsize = (fifocon >> CANFD_FIFO_PLSIZE_SHIFT) & 0x7u;
    return 8u + plsize_to_bytes[plsize];   /* 2 header words + payload */
}

/*
 * Message RAM layout helpers
 *
 * Layout (sequential from msg_ram_phys):
 *   [TXQ  region] if TXQEN
 *   [TEF  region] if STEF
 *   [FIFO 1..31]
 *
 * For simplicity we pre-allocate the maximum per region and compute
 * offsets statically from the FIFO configuration registers.
 * -----------------------------------------------------------------------
 */

#define CANFD_MAX_OBJ_SIZE  72u   /* 8 header + 64 payload */
#define CANFD_MAX_DEPTH     32u   /* FSIZE+1 max */

static uint32_t canfd_txq_ram_base(PIC32MKCANFDState *s)
{
    return s->msg_ram_phys;
}

static uint32_t canfd_txq_obj_size(PIC32MKCANFDState *s)
{
    return canfd_obj_size(s->txqcon);
}

static uint32_t canfd_txq_depth(PIC32MKCANFDState *s)
{
    return ((s->txqcon >> CANFD_FIFO_FSIZE_SHIFT) & 0x1Fu) + 1u;
}

/* Region base for FIFO n (1-based) within the message RAM buffer */
static uint32_t canfd_fifo_ram_base(PIC32MKCANFDState *s, int n)
{
    /* TXQ region */
    uint32_t off = 0;
    if (s->con & CANFD_CON_TXQEN) {
        off += canfd_txq_obj_size(s) * canfd_txq_depth(s);
    }
    /* TEF region (each TEF object = 8 bytes, no payload) */
    if (s->con & CANFD_CON_STEF) {
        uint32_t tef_depth = ((s->tefcon >> CANFD_FIFO_FSIZE_SHIFT) & 0x1Fu) + 1u;
        off += 8u * tef_depth;
    }
    /* FIFOs 1..n-1 */
    for (int i = 1; i < n; i++) {
        uint32_t depth = ((s->fifocon[i] >> CANFD_FIFO_FSIZE_SHIFT) & 0x1Fu) + 1u;
        off += canfd_obj_size(s->fifocon[i]) * depth;
    }
    return s->msg_ram_phys + off;
}

static uint32_t canfd_fifo_slot_ua(PIC32MKCANFDState *s, int n, uint8_t slot)
{
    return canfd_fifo_ram_base(s, n) + (uint32_t)slot * canfd_obj_size(s->fifocon[n]);
}

static uint32_t canfd_txq_slot_ua(PIC32MKCANFDState *s, uint8_t slot)
{
    return canfd_txq_ram_base(s) + (uint32_t)slot * canfd_txq_obj_size(s);
}

/*
 * IRQ update — recomputes CiINT status bits and asserts/deasserts IRQ
 * -----------------------------------------------------------------------
 */

static void canfd_update_irq(PIC32MKCANFDState *s)
{
    bool fire = false;

    /* RXIF: any RX FIFO has data */
    if (s->cint & CANFD_INT_RXIE) {
        if (s->rxif) {
            s->cint |= CANFD_INT_RXIF;
            fire = true;
        } else {
            s->cint &= ~CANFD_INT_RXIF;
        }
    }

    /* TXIF: any TX FIFO / TXQ completed */
    if (s->cint & CANFD_INT_TXIE) {
        if (s->txif) {
            s->cint |= CANFD_INT_TXIF;
            fire = true;
        } else {
            s->cint &= ~CANFD_INT_TXIF;
        }
    }

    /* MODIF: mode changed and MODIE enabled */
    if ((s->cint & CANFD_INT_MODIE) && (s->cint & CANFD_INT_MODIF)) {
        fire = true;
    }

    /* RXOVIF: any RX overflow and RXOVIE enabled */
    if ((s->cint & CANFD_INT_RXOVIE) && (s->cint & CANFD_INT_RXOVIF)) {
        fire = true;
    }

    qemu_set_irq(s->irq, fire ? 1 : 0);
}

/*
 * Acceptance filter matching
 * Returns destination FIFO index (1-based) or -1 if no match.
 * -----------------------------------------------------------------------
 */

static int canfd_find_fifo(PIC32MKCANFDState *s, uint32_t id, bool xtd)
{
    for (int n = 0; n < 32; n++) {
        /* Each CiFLTCON register holds 4 filter bytes */
        uint8_t fltcon_byte = (s->fltcon[n / 4] >> ((n % 4) * 8)) & 0xFFu;
        if (!(fltcon_byte & 0x80u)) {
            continue;   /* FLTEN = 0 */
        }

        uint32_t obj  = s->fltobj[n];
        uint32_t msk  = s->mask[n];

        /*
         * MIDE bit (bit 29 of CiMASKn): when set, the filter only matches
         * frames whose IDE bit equals FLTOBJ.IDE (bit 30).
         * When MIDE=0, the filter accepts both standard and extended frames.
         */
        if (msk & (1u << 29u)) {
            bool obj_xtd = (obj >> 30) & 1u;
            if (obj_xtd != xtd) {
                continue;
            }
        }

        /* (frame_id XOR filter_id) AND mask == 0 means match */
        if ((id ^ (obj & 0x1FFFFFFFu)) & (msk & 0x1FFFFFFFu)) {
            continue;
        }

        return fltcon_byte & 0x1Fu;   /* destination FIFO */
    }
    return -1;
}

