patchew-project/qemu/hw/mips/pic32mk_canfd.c
/*
 * RX deliver — write an incoming frame into the matching RX FIFO
 * -----------------------------------------------------------------------
 */

static void canfd_rx_deliver(PIC32MKCANFDState *s,
                             uint32_t id, bool xtd, bool fdf,
                             uint8_t dlc, const uint8_t *data, int len,
                             int filter_hit)
{
    int dest = filter_hit;
    if (dest < 1 || dest > 31) {
        return;
    }

    uint32_t depth = ((s->fifocon[dest] >> CANFD_FIFO_FSIZE_SHIFT) & 0x1Fu) + 1u;
    if (s->fifo_count[dest] >= (uint8_t)depth) {
        /* Overflow */
        s->rxovif |= (1u << dest);
        s->cint   |= CANFD_INT_RXOVIF;
        canfd_update_irq(s);
        return;
    }

    /* Write message object to tail slot */
    uint32_t ua = canfd_fifo_slot_ua(s, dest, s->fifo_tail[dest]);
    uint32_t ram_off = ua - s->msg_ram_phys;
    uint8_t *obj = s->msg_ram_buf + ram_off;
    uint32_t payload_cap = canfd_obj_size(s->fifocon[dest]) - 8u;
    uint8_t dlc_len = canfd_dlc_bytes(dlc, fdf);
    uint8_t copy_len = (uint8_t)MIN((uint32_t)MAX(len, 0), payload_cap);
    if (copy_len > dlc_len) {
        copy_len = dlc_len;
    }

    /*
     * RX message object R0/R1 layout (DS60001507 Table 38-2):
     *   R0[10:0]  : SID[10:0]  (or upper 11 of 29-bit EID)
     *   R0[28:11] : EID[17:0]  (lower 18 bits of 29-bit extended ID)
     *   R0[30]    : EXIDE      (1 = extended frame) — matches CiFLTOBJ layout
     *   R1[4]     : IDE        (1 = extended frame) — this is what plib_canfd checks
     * Note: TX T0 has the same SID/EID layout but IDE is in T1[4], not T0[30].
     */
    uint32_t r0;
    if (xtd) {
        /* 29-bit extended: SID = ID[28:18], EID = ID[17:0] */
        r0 = ((id >> 18) & 0x7FFu)          /* SID → r0 bits [10:0]  */
           | ((id & 0x3FFFFu) << 11)         /* EID → r0 bits [28:11] */
           | (1u << 30u);                    /* IDE = 1                */
    } else {
        r0 = id & 0x7FFu;                   /* SID → r0 bits [10:0]  */
    }
    *(uint32_t *)(obj + 0) = r0;

    /* R1: DLC, flags, FILHIT, RXTS=0 */
    uint32_t r1 = (uint32_t)dlc
                | (xtd ? (1u << 4) : 0u)
                | (fdf ? (1u << 7) : 0u)
                | ((uint32_t)(filter_hit & 0x1F) << 11);
    *(uint32_t *)(obj + 4) = r1;

    /*
     * RX message data area layout (DS60001507 Figure 3-2):
     *   data[0..3] : RXMSGTS — 32-bit receive timestamp (always present when
     *                RXTSEN=1 in FIFOCONn; firmware expects this field)
     *   data[4..]  : Payload bytes
     *
     * Harmony3 plib_canfd always reads payload from data[4] onwards, so we
     * must write a timestamp (even if 0) before the payload.
     */
    memset(obj + 8, 0, payload_cap);           /* Clear timestamp + payload */
    *(uint32_t *)(obj + 8) = s->tbc;           /* Write timestamp at data[0..3] */
    if (copy_len > 0 && data) {
        memcpy(obj + 12, data, copy_len);      /* Payload starts at data[4] */
    }

    /* Advance tail */
    s->fifo_tail[dest] = (s->fifo_tail[dest] + 1u) % (uint8_t)depth;
    s->fifo_count[dest]++;

    /*
     * Set interrupt flags — TFNRFNIF signals data present.
     * Only assert RXIF if TFNRFNIE (per-FIFO RX interrupt enable) is set;
     * otherwise the frame waits silently until firmware arms reception
     * via CAN_MessageReceive() which re-enables TFNRFNIE.
      */
    s->fifosta[dest] |= CANFD_FIFOSTA_TFNRFNIF;
    if (s->fifocon[dest] & CANFD_FIFO_TFNRFNIE) {
        s->rxif |= (1u << dest);
    }

    /*
     * Update UA: RX has no write slot; keep head slot for firmware read.
     */
    s->fifoua[dest] = canfd_fifo_slot_ua(s, dest, s->fifo_head[dest]);

    /* CiVEC.ICODE — firmware RX ISR reads this to learn which FIFO fired */
    s->vec = (uint32_t)dest & 0x7Fu;

    canfd_update_irq(s);
}

/*
 * TX processing — triggered when TXREQ is set for a FIFO or TXQ
 * -----------------------------------------------------------------------
 */

static void canfd_process_tx(PIC32MKCANFDState *s, int fifo)
{
    uint32_t ua;
    if (fifo == 0) {
        /* TXQ: transmit from head (oldest queued frame) */
        ua = canfd_txq_slot_ua(s, s->txq_head);
    } else {
        /* TX FIFO: transmit from head (oldest pending frame) */
        ua = canfd_fifo_slot_ua(s, fifo, s->fifo_head[fifo]);
    }

    uint32_t ram_off = ua - s->msg_ram_phys;
    if (ram_off >= PIC32MK_CAN_MSGRAM_SIZE) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "pic32mk-canfd: TX UA 0x%08x out of message RAM\n", ua);
        return;
    }

    const uint8_t *obj = s->msg_ram_buf + ram_off;
    uint32_t t0  = *(const uint32_t *)(obj + 0);
    uint32_t t1  = *(const uint32_t *)(obj + 4);
    uint8_t  dlc = t1 & 0xFu;
    bool     fdf = (t1 >> 7) & 1u;
    bool     xtd = (t1 >> 4) & 1u;   /* IDE in T1[4], not T0[30] per DS60001507 s3.1 */
    /* T0 ID layout: SID in bits[10:0], EID in bits[28:11] (same as R0/CiFLTOBJ) */
    uint32_t id  = xtd ? (((t0 & 0x7FFu) << 18) | ((t0 >> 11) & 0x3FFFFu))
                       : (t0 & 0x7FFu);
    int      len = canfd_dlc_bytes(dlc, fdf);
    const uint8_t *data = obj + 8;

    uint8_t opmod = (s->con >> CANFD_CON_OPMOD_SHIFT) & 0x7u;
    if (opmod == CANFD_OPMOD_INT_LOOP) {
        /* Internal loopback: deliver frame through acceptance filters */
        int dest = canfd_find_fifo(s, id, xtd);
        if (dest >= 1) {
            canfd_rx_deliver(s, id, xtd, fdf, dlc, data, len, dest);
        }
    } else {
        /* External TX: send frame to the virtual CAN bus */
        qemu_can_frame frame = {};
        frame.can_id  = xtd ? (id | QEMU_CAN_EFF_FLAG) : id;
        frame.can_dlc = (uint8_t)len;
        frame.flags   = fdf ? QEMU_CAN_FRMF_TYPE_FD : 0u;
        memcpy(frame.data, data, (size_t)len);
        if (s->canbus) {
            can_bus_client_send(&s->bus_client, &frame, 1);
        } else {
            qemu_log_mask(LOG_UNIMP,
                          "pic32mk-canfd[%u]: no canbus connected, "
                          "dropping TX frame id=0x%08x\n", s->instance_id, id);
        }
    }

    /* TX complete bookkeeping */
    if (fifo == 0) {
        /* TXQ: advance head (oldest pending frame consumed) */
        uint8_t depth = (uint8_t)canfd_txq_depth(s);
        s->txq_head = (s->txq_head + 1u) % depth;
        if (s->txq_count > 0) {
            s->txq_count--;
        }
        s->txqcon  &= ~CANFD_FIFO_TXREQ;
        s->txqsta  |= CANFD_TXQSTA_TXQNIF;  /* slot available */
        s->txif    |= 1u;          /* bit 0 = TXQ */
        s->vec      = 0u;          /* ICODE=0 for TXQ */
    } else {
        uint32_t depth = ((s->fifocon[fifo] >> CANFD_FIFO_FSIZE_SHIFT) & 0x1Fu) + 1u;
        s->fifo_head[fifo] = (s->fifo_head[fifo] + 1u) % (uint8_t)depth;
        if (s->fifo_count[fifo] > 0) {
            s->fifo_count[fifo]--;
        }
        s->fifocon[fifo] &= ~CANFD_FIFO_TXREQ;
        s->fifosta[fifo] |= CANFD_FIFOSTA_TXATIF;
        /* TX slot freed — TX FIFO is no longer full */
        s->fifosta[fifo] |= CANFD_FIFOSTA_TFNRFNIF;
        s->txif |= (1u << fifo);
        s->vec   = (uint32_t)fifo & 0x7Fu;  /* ICODE = FIFO number */
    }

    canfd_update_irq(s);
}

