patchew-project/qemu/hw/mips/pic32mk_canfd.c
/* Forward declaration — defined below canfd_receive() */
static void canfd_bus_buf_drain(PIC32MKCANFDState *s);

/*
 * UINC — advance head (RX) or tail (TX) pointer, clear UINC bit
 * -----------------------------------------------------------------------
 */

static void canfd_uinc_fifo(PIC32MKCANFDState *s, int n)
{
    bool is_tx = (s->fifocon[n] & CANFD_FIFO_TXEN) != 0u;
    uint32_t depth = ((s->fifocon[n] >> CANFD_FIFO_FSIZE_SHIFT) & 0x1Fu) + 1u;

    if (is_tx) {
        /* Firmware finished writing a TX object — advance tail */
        s->fifo_tail[n] = (s->fifo_tail[n] + 1u) % (uint8_t)depth;
        s->fifo_count[n]++;
        s->fifoua[n] = canfd_fifo_slot_ua(s, n, s->fifo_tail[n]);
        /* TX FIFO full — clear "not full" flag so firmware won't overwrite */
        if (s->fifo_count[n] >= (uint8_t)depth) {
            s->fifosta[n] &= ~CANFD_FIFOSTA_TFNRFNIF;
        }
    } else {
        /* Firmware finished reading an RX object — advance head */
        if (s->fifo_count[n] > 0) {
            s->fifo_count[n]--;
        }
        s->fifo_head[n] = (s->fifo_head[n] + 1u) % (uint8_t)depth;
        s->fifoua[n] = canfd_fifo_slot_ua(s, n, s->fifo_head[n]);

        if (s->fifo_count[n] == 0) {
            s->rxif     &= ~(1u << n);
            s->fifosta[n] &= ~CANFD_FIFOSTA_TFNRFNIF;
        }
        canfd_update_irq(s);
        /*
         * Drain bus_buf after UINC: firmware just freed a FIFO slot, so the
         * next buffered frame can be delivered immediately.  In polling mode
         * the firmware checks FIFOSTA.TFNRFNIF directly after UINC; delivering
         * here ensures that flag is set before the next poll.  In interrupt
         * mode with TFNRFNIE enabled, canfd_rx_deliver will re-raise the IRQ
         * for the newly delivered frame.
          */
        canfd_bus_buf_drain(s);
    }
}

static void canfd_uinc_txq(PIC32MKCANFDState *s)
{
    uint8_t depth = (uint8_t)canfd_txq_depth(s);
    /* Advance tail — firmware finished writing a TX object */
    s->txq_tail = (s->txq_tail + 1u) % depth;
    s->txq_count++;
    /* UA now points at the next empty write slot */
    s->txqua = canfd_txq_slot_ua(s, s->txq_tail);
}

/*
 * FRESET — reset a FIFO to empty state
 * -----------------------------------------------------------------------
 */

static void canfd_freset_fifo(PIC32MKCANFDState *s, int n)
{
    s->fifo_head[n]  = 0;
    s->fifo_tail[n]  = 0;
    s->fifo_count[n] = 0;
    s->rxif         &= ~(1u << n);
    s->txif         &= ~(1u << n);
    s->fifosta[n]    = 0;
    /* TX FIFO: empty after reset means "not full" → TFNRFNIF = 1 */
    if (s->fifocon[n] & CANFD_FIFO_TXEN) {
        s->fifosta[n] |= CANFD_FIFOSTA_TFNRFNIF;
    }
    s->fifoua[n]     = canfd_fifo_slot_ua(s, n, 0);
    canfd_update_irq(s);
}

/*
 * Abort all pending TX (CiCON.ABAT)
 * -----------------------------------------------------------------------
 */

static void canfd_abort_all_tx(PIC32MKCANFDState *s)
{
    /* TXQ */
    s->txqcon  &= ~CANFD_FIFO_TXREQ;
    s->txqsta  |= CANFD_TXQSTA_TXQNIF;

    /* TX FIFOs */
    for (int i = 1; i < 32; i++) {
        if (s->fifocon[i] & CANFD_FIFO_TXEN) {
            s->fifocon[i] &= ~CANFD_FIFO_TXREQ;
            s->fifosta[i] |= CANFD_FIFOSTA_TXATIF;
            s->txif |= (1u << i);
        }
    }
    canfd_update_irq(s);
}

/*
 * SocketCAN virtual bus callbacks
 *
 * When a can-bus object is linked (via the "canbus" QOM property), the
 * device behaves as a bus participant:
 *   TX (non-loopback): canfd_process_tx() calls can_bus_client_send()
 *   RX (from bus):     canfd_receive() delivers frames through the
 *                      acceptance filter into an RX FIFO
 * -----------------------------------------------------------------------
 */

static bool canfd_can_receive(CanBusClientState *client)
{
    PIC32MKCANFDState *s = container_of(client, PIC32MKCANFDState, bus_client);
    uint8_t opmod = (s->con >> CANFD_CON_OPMOD_SHIFT) & 0x7u;
    /*
     * Accept incoming frames in Normal, External Loopback, Listen-only,
     * and Restricted modes — not in Config or Internal Loopback mode.
      */
    return opmod == CANFD_OPMOD_NORMAL
        || opmod == CANFD_OPMOD_EXT_LOOP
        || opmod == CANFD_OPMOD_LISTEN
        || opmod == CANFD_OPMOD_RESTRICTED;
}

/*
 * Drain the software bus buffer into hardware RX FIFOs.
 * Called after each RX UINC — the firmware just freed a FIFO slot so we can
 * deliver at most one buffered frame per UINC (matching real FIFO depth-1
 * behaviour).  Stops when the head frame's target FIFO is still full.
 */
static void canfd_bus_buf_drain(PIC32MKCANFDState *s)
{
    while (s->bus_buf_count > 0) {
        int n = s->bus_buf_head;
        int dest = s->bus_buf_dest[n];
        uint32_t depth = ((s->fifocon[dest] >> CANFD_FIFO_FSIZE_SHIFT) & 0x1Fu) + 1u;
        if (s->fifo_count[dest] >= (uint8_t)depth) {
            break;  /* target FIFO still full — wait for next UINC */
        }
        canfd_rx_deliver(s,
                         s->bus_buf_id[n], s->bus_buf_xtd[n],
                         s->bus_buf_fdf[n], s->bus_buf_dlc[n],
                         s->bus_buf_data[n], s->bus_buf_len[n], dest);
        s->bus_buf_head = (s->bus_buf_head + 1) % 64;
        s->bus_buf_count--;
    }
}

static ssize_t canfd_receive(CanBusClientState *client,
                             const qemu_can_frame *frames, size_t frames_cnt)
{
    PIC32MKCANFDState *s = container_of(client, PIC32MKCANFDState, bus_client);

    for (size_t i = 0; i < frames_cnt; i++) {
        const qemu_can_frame *f = &frames[i];
        bool     xtd = (f->can_id & QEMU_CAN_EFF_FLAG) != 0;
        uint32_t id  = xtd ? (f->can_id & QEMU_CAN_EFF_MASK)
                           : (f->can_id & QEMU_CAN_SFF_MASK);
        bool     fdf = (f->flags & QEMU_CAN_FRMF_TYPE_FD) != 0;
        uint8_t  dlc = can_len2dlc(f->can_dlc);
        uint8_t  rx_len = MIN((uint8_t)f->can_dlc, canfd_dlc_bytes(dlc, fdf));
        int      dest = canfd_find_fifo(s, id, xtd);

