patchew-project/qemu/hw/mips/pic32mk_canfd.c
        /* Log received frame with full payload hex dump */

        if (dest < 1) {
            continue;  /* no filter match */
        }

        uint32_t depth = ((s->fifocon[dest] >> CANFD_FIFO_FSIZE_SHIFT) & 0x1Fu) + 1u;
        if (s->fifo_count[dest] < (uint8_t)depth) {
            /* FIFO has space — deliver directly */
            canfd_rx_deliver(s, id, xtd, fdf, dlc, f->data, rx_len, dest);
        } else if (s->bus_buf_count < 64) {
            /* FIFO full — buffer for later delivery after UINC */
            int slot = s->bus_buf_tail;
            s->bus_buf_id[slot]  = id;
            s->bus_buf_xtd[slot] = xtd;
            s->bus_buf_fdf[slot] = fdf;
            s->bus_buf_dlc[slot] = dlc;
            s->bus_buf_len[slot] = rx_len;
            s->bus_buf_dest[slot] = dest;
            memcpy(s->bus_buf_data[slot], f->data, rx_len);
            s->bus_buf_tail = (s->bus_buf_tail + 1) % 64;
            s->bus_buf_count++;
        } else {
            /* Software buffer also full — real bus overflow */
            s->rxovif |= (1u << dest);
            s->cint   |= CANFD_INT_RXOVIF;
            canfd_update_irq(s);
        }
    }
    return (ssize_t)frames_cnt;
}

static CanBusClientInfo canfd_bus_client_info = {
    .can_receive = canfd_can_receive,
    .receive     = canfd_receive,
};

/*
 * SFR MMIO read
 *
 * Each logical register occupies 0x10 bytes: +0=base, +4=SET, +8=CLR, +C=INV.
 * Reads always return the base register value regardless of sub-offset.
 * -----------------------------------------------------------------------
 */

static uint64_t canfd_sfr_read(void *opaque, hwaddr offset, unsigned size)
{
    PIC32MKCANFDState *s = opaque;
    /* Strip SET/CLR/INV sub-offset: base is at (offset & ~0xCu) */
    hwaddr base_off = offset & ~0xCu;

    switch (base_off) {
    case CANFD_CiCON:
        return s->con;
    case CANFD_CiNBTCFG:
        return s->nbtcfg;
    case CANFD_CiDBTCFG:
        return s->dbtcfg;
    case CANFD_CiTDC:
        return s->tdc;
    case CANFD_CiTBC:
        return s->tbc;
    case CANFD_CiTSCON:
        return s->tscon;
    case CANFD_CiVEC:
        return s->vec;
    case CANFD_CiINT:
        return s->cint;
    case CANFD_CiRXIF:
        return s->rxif;
    case CANFD_CiTXIF:
        return s->txif;
    case CANFD_CiRXOVIF:
        return s->rxovif;
    case CANFD_CiTXATIF:
        return 0;
    case CANFD_CiTXREQ:
        return s->txreq;
    case CANFD_CiTREC:
        return s->trec;
    case CANFD_CiTEFCON:
        return s->tefcon;
    case CANFD_CiTEFSTA:
        return s->tefsta;
    case CANFD_CiTEFUA:
        return s->tefua;
    case CANFD_CiFIFOBA:
        return 0;
    case CANFD_CiTXQCON:
        return s->txqcon;
    case CANFD_CiTXQSTA:
        return s->txqsta;
    case CANFD_CiTXQUA:
        return s->txqua;
    default:
        break;
    }

    /*
     * FIFO registers: base 0x170, stride 0x30 per FIFO (n=1..31)
     *   +0x00: CiFIFOCONn, +0x10: CiFIFOSTAn, +0x20: CiFIFOUAn
      */
    if (base_off >= CANFD_CiFIFOCON(1) && base_off <= CANFD_CiFIFOCON(31) + 0x20u) {
        int idx = (int)((base_off - 0x170u) / 0x30u) + 1;
        int sub = (int)((base_off - 0x170u) % 0x30u);
        if (idx >= 1 && idx <= 31) {
            if (sub == 0x00) {
                return s->fifocon[idx];
            }
            if (sub == 0x10) {
                return s->fifosta[idx];
            }
            if (sub == 0x20) {
                return s->fifoua[idx];
            }
        }
    }

    /* Filter control: stride 0x10 per register (r=0..7) */
    if (base_off >= CANFD_CiFLTCON(0) && base_off <= CANFD_CiFLTCON(7)) {
        return s->fltcon[(base_off - 0x740u) / 0x10u];
    }

    /* Filter obj/mask: stride 0x20 per pair (n=0..31) */
    if (base_off >= CANFD_CiFLTOBJ(0) && base_off <= CANFD_CiMASK(31)) {
        if (base_off >= 0x7C0u && base_off < 0x7C0u + 32u * 0x20u) {
            int fn = (int)((base_off - 0x7C0u) / 0x20u);
            return s->fltobj[fn];
        }
        if (base_off >= 0x7D0u && base_off < 0x7D0u + 32u * 0x20u) {
            int fn = (int)((base_off - 0x7D0u) / 0x20u);
            return s->mask[fn];
        }
    }

    qemu_log_mask(LOG_UNIMP,
                  "pic32mk-canfd: unimplemented SFR read @ +0x%03" HWADDR_PRIx "\n",
                  offset);
    return 0;
}

/*
 * Apply a CLR/SET/INV write to a register value.
 * PIC32MK convention: sub=0 → plain write, +4 → CLR, +8 → SET, +0xC → INV
 * -----------------------------------------------------------------------
 */
static uint32_t apply_sci(uint32_t cur, uint32_t val, int sub)
{
    switch (sub) {
    case 0:
        return val;
    case 4:
        return cur & ~val;
    case 8:
        return cur | val;
    case 0xC:
        return cur ^ val;
    default:
        return cur;
    }
}

/*
 * SFR MMIO write
 *
 * Each logical register occupies 0x10 bytes: +0=base, +4=SET, +8=CLR, +C=INV.
 * UINC, TXREQ, FRESET are pulse bits — handled then stripped from storage.
 * -----------------------------------------------------------------------
 */

static void canfd_sfr_write(void *opaque, hwaddr offset, uint64_t val,
                            unsigned size)
{
    PIC32MKCANFDState *s = opaque;
    uint32_t v32     = (uint32_t)val;
    hwaddr   base_off = offset & ~0xCu;
    int      sub     = (int)(offset & 0xCu);
    uint8_t  opmod   = (s->con >> CANFD_CON_OPMOD_SHIFT) & 0x7u;

    switch (base_off) {

    /* ---- CiCON ---- */
    case CANFD_CiCON: {
        uint8_t old_opmod = opmod;
        uint32_t new_con  = apply_sci(s->con, v32, sub);

        uint8_t reqop = (new_con >> CANFD_CON_REQOP_SHIFT) & 0x7u;
        /* Reflect REQOP into OPMOD immediately; BUSY always 0 */
        new_con = (new_con & ~CANFD_CON_OPMOD_MASK)
                | ((uint32_t)reqop << CANFD_CON_OPMOD_SHIFT);
        s->con = new_con;

        if (reqop != old_opmod) {
            s->cint |= CANFD_INT_MODIF;
            canfd_update_irq(s);
        }

        /* Handle ABAT */
        if (new_con & CANFD_CON_ABAT) {
            canfd_abort_all_tx(s);
            s->con &= ~CANFD_CON_ABAT;
        }

        /* Initialise TXQ UA when TXQEN becomes set */
        if ((new_con & CANFD_CON_TXQEN) && !(s->txqua)) {
            s->txqua = canfd_txq_slot_ua(s, s->txq_tail);
        }
        return;
    }

    /* ---- Bit-time / TDC — only writable in Config mode ---- */
    case CANFD_CiNBTCFG:
        if (opmod == CANFD_OPMOD_CONFIG) {
            s->nbtcfg = apply_sci(s->nbtcfg, v32, sub);
        }
        return;
    case CANFD_CiDBTCFG:
        if (opmod == CANFD_OPMOD_CONFIG) {
            s->dbtcfg = apply_sci(s->dbtcfg, v32, sub);
        }
        return;
    case CANFD_CiTDC:
        if (opmod == CANFD_OPMOD_CONFIG) {
            s->tdc = apply_sci(s->tdc, v32, sub);
        }
        return;
    case CANFD_CiTSCON:
        s->tscon = apply_sci(s->tscon, v32, sub);
        return;

    /* CiINT: enable bits [31:16] writable; status [15:0] cleared by fw */
    case CANFD_CiINT:
        s->cint = apply_sci(s->cint, v32, sub);
        canfd_update_irq(s);
        return;

    /* ---- CiRXIF / CiTXIF / CiRXOVIF — firmware clears by writing 0 ---- */
    case CANFD_CiRXIF:
        s->rxif = apply_sci(s->rxif, v32, sub);
        canfd_update_irq(s);
        return;
    case CANFD_CiTXIF:
        s->txif = apply_sci(s->txif, v32, sub);
        canfd_update_irq(s);
        return;
    case CANFD_CiRXOVIF:
        s->rxovif = apply_sci(s->rxovif, v32, sub);
        return;

