patchew-project/qemu/hw/mips/pic32mk_canfd.c
    /* ---- CiTXREQ — writing 1 to a bit requests TX for that FIFO ---- */
    case CANFD_CiTXREQ: {
        uint32_t new_req = apply_sci(s->txreq, v32, sub);
        uint32_t newly   = new_req & ~s->txreq;
        s->txreq = new_req;
        for (int i = 1; i < 32; i++) {
            if (newly & (1u << i)) {
                canfd_process_tx(s, i);
            }
        }
        return;
    }

    /* ---- CiTXQCON ---- */
    case CANFD_CiTXQCON: {
        uint32_t new_con = apply_sci(s->txqcon, v32, sub);
        bool uinc = (new_con & CANFD_FIFO_UINC)  != 0u;
        bool req  = (new_con & CANFD_FIFO_TXREQ) != 0u;
        s->txqcon = new_con & ~(CANFD_FIFO_UINC | CANFD_FIFO_TXREQ
                                | CANFD_FIFO_FRESET);
        /*
         * Clearing TXQEIE (bit 4) acknowledges TX completion — deassert TXQ
         * source in txif so TXIF is not re-asserted on the next irq update.
          */
        if (!(s->txqcon & (1u << 4u))) {
            s->txif &= ~1u;
            canfd_update_irq(s);
        }
        if (uinc) {
            canfd_uinc_txq(s);
        }
        if (req) {
            canfd_process_tx(s, 0);
        }
        return;
    }

    /* ---- CiTXQSTA / CiTXQUA — hardware-managed, ignore firmware writes ---- */
    case CANFD_CiTXQSTA:
    case CANFD_CiTXQUA:
        return;

    /* ---- TEF (stub) ---- */
    case CANFD_CiTEFCON:
        s->tefcon = apply_sci(s->tefcon, v32, sub);
        return;
    case CANFD_CiTEFSTA:
        s->tefsta = apply_sci(s->tefsta, v32, sub);
        return;
    case CANFD_CiTEFUA:
        return;

    /* ---- CiFIFOBA — Phase 3C stub: log and ignore ---- */
    case CANFD_CiFIFOBA:
        if (sub == 0) {
            qemu_log_mask(LOG_UNIMP,
                "pic32mk-canfd: CiFIFOBA write 0x%08x (Phase 3C stub, "
                "using fixed msg RAM base 0x%08x)\n",
                v32, s->msg_ram_phys);
        }
        return;

    default:
        break;
    }

    /*
     * ---- FIFO registers: base 0x170, stride 0x30 per FIFO (n=1..31)
     *   +0x00: CiFIFOCONn, +0x10: CiFIFOSTAn, +0x20: CiFIFOUAn ----
      */
    if (base_off >= CANFD_CiFIFOCON(1) && base_off <= CANFD_CiFIFOCON(31) + 0x20u) {
        int idx      = (int)((base_off - 0x170u) / 0x30u) + 1;
        int field    = (int)((base_off - 0x170u) % 0x30u);
        if (idx < 1 || idx > 31) {
            return;
        }

        if (field == 0x00) {
            /* CiFIFOCONn */
            uint32_t new_con = apply_sci(s->fifocon[idx], v32, sub);

            if (new_con & CANFD_FIFO_FRESET) {
                s->fifocon[idx] = new_con & ~CANFD_FIFO_FRESET;
                canfd_freset_fifo(s, idx);
                return;
            }

            bool uinc  = (new_con & CANFD_FIFO_UINC)  != 0u;
            bool txreq = (new_con & CANFD_FIFO_TXREQ)  != 0u;
            s->fifocon[idx] = new_con & ~(CANFD_FIFO_UINC | CANFD_FIFO_TXREQ);

            /*
             * First-time TX FIFO configuration (Harmony CAN1..4 init pattern):
             * firmware writes FIFOCONn with TXEN set; at this point the FIFO
             * is empty so it is "not full" and FIFOUA must point to slot 0.
             * Mirror the TXQ treatment: set TFNRFNIF=1 and initialise UA.
              */
            if ((s->fifocon[idx] & CANFD_FIFO_TXEN) && s->fifoua[idx] == 0) {
                s->fifosta[idx] |= CANFD_FIFOSTA_TFNRFNIF;
                s->fifoua[idx] = canfd_fifo_slot_ua(s, idx, 0);
            }

            /*
             * Clearing TFERFFIE (bit 4) acknowledges TX completion for this
             * FIFO — deassert its txif source bit.
              */
            if (!(s->fifocon[idx] & (1u << 4u))) {
                s->txif &= ~(1u << idx);
                canfd_update_irq(s);
            }
            if (uinc) {
                canfd_uinc_fifo(s, idx);
            }
            if (txreq && (s->fifocon[idx] & CANFD_FIFO_TXEN)) {
                canfd_process_tx(s, idx);
            }

            /*
             * For RX FIFOs, honour TFNRFNIE: if the firmware just toggled it,
             * update rxif to match the real hardware behaviour.
             * Enabling  → IRQ rises  (frame already in FIFO fires interrupt)
             * Disabling → IRQ falls  (flow-control)
              */
            if (!(s->fifocon[idx] & CANFD_FIFO_TXEN)) {
                bool new_ie   = (s->fifocon[idx] & CANFD_FIFO_TFNRFNIE) != 0;
                bool has_data = (s->fifosta[idx] & CANFD_FIFOSTA_TFNRFNIF) != 0;
                if (has_data && new_ie) {
                    s->rxif |= (1u << idx);
                } else {
                    s->rxif &= ~(1u << idx);
                }
                canfd_update_irq(s);
            }

        } else if (field == 0x10) {
            /* CiFIFOSTAn — firmware can clear status flags */
            s->fifosta[idx] = apply_sci(s->fifosta[idx], v32, sub);
            if (!(s->fifosta[idx] & CANFD_FIFOSTA_TFNRFNIF)) {
                if (s->fifo_count[idx] == 0) {
                    s->rxif &= ~(1u << idx);
                }
            }
            canfd_update_irq(s);
        }
        /* CiFIFOUA (+0x20) is hardware-owned, ignore writes */
        return;
    }

    /* ---- Filter control: stride 0x10 per register (r=0..7) ---- */
    if (base_off >= CANFD_CiFLTCON(0) && base_off <= CANFD_CiFLTCON(7)) {
        int reg = (int)((base_off - 0x740u) / 0x10u);
        s->fltcon[reg] = apply_sci(s->fltcon[reg], v32, sub);
        return;
    }

    /* ---- Filter object / mask — only writable in Config mode ---- */
    if (base_off >= CANFD_CiFLTOBJ(0) && base_off < 0x7D0u + 32u * 0x20u) {
        if (opmod != CANFD_OPMOD_CONFIG) {
            return;
        }
        if (base_off >= 0x7C0u && base_off < 0x7C0u + 32u * 0x20u) {
            int fn = (int)((base_off - 0x7C0u) / 0x20u);
            s->fltobj[fn] = apply_sci(s->fltobj[fn], v32, sub);
        } else if (base_off >= 0x7D0u) {
            int fn = (int)((base_off - 0x7D0u) / 0x20u);
            if (fn < 32) {
                s->mask[fn] = apply_sci(s->mask[fn], v32, sub);
            }
        }
        return;
    }

    qemu_log_mask(LOG_UNIMP,
                  "pic32mk-canfd: unimplemented SFR write @ +0x%03" HWADDR_PRIx
                  " = 0x%08x\n", offset, v32);
}

static const MemoryRegionOps canfd_sfr_ops = {
    .read       = canfd_sfr_read,
    .write      = canfd_sfr_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
    },
};

