patchew-project/qemu/hw/mips/pic32mk_canfd.c
/*
 * Device lifecycle
 * -----------------------------------------------------------------------
 */

static void pic32mk_canfd_reset(DeviceState *dev)
{
    PIC32MKCANFDState *s = PIC32MK_CANFD(dev);

    s->con     = CANFD_CON_RESET;    /* OPMOD=100 (Config), REQOP=100 */
    s->nbtcfg  = 0;
    s->dbtcfg  = 0;
    s->tdc     = 0;
    s->tbc     = 0;
    s->tscon   = 0;
    s->vec     = 0;
    s->cint    = 0;
    s->rxif    = 0;
    s->txif    = 0;
    s->rxovif  = 0;
    s->txreq   = 0;
    s->trec    = 0;
    s->tefcon  = 0;
    s->tefsta  = 0;
    s->tefua   = 0;
    s->txqcon  = 0;
    s->txqsta   = CANFD_TXQSTA_TXQNIF;  /* TXQNIF=1 (bit 0) — slot available on reset */
    s->txq_head  = 0;
    s->txq_tail  = 0;
    s->txq_count = 0;
    s->txqua    = 0;          /* will be computed when TXQEN is set */

    for (int i = 0; i < 32; i++) {
        s->fifocon[i]   = 0;
        s->fifosta[i]   = 0;
        s->fifoua[i]    = 0;
        s->fifo_head[i] = 0;
        s->fifo_tail[i] = 0;
        s->fifo_count[i] = 0;
        s->fltobj[i]    = 0;
        s->mask[i]      = 0;
    }
    for (int i = 0; i < 8; i++) {
        s->fltcon[i] = 0;
    }

    /* Clear message RAM */
    if (s->msg_ram_buf) {
        memset(s->msg_ram_buf, 0, PIC32MK_CAN_MSGRAM_SIZE);
    }

    /* Reset software bus buffer */
    s->bus_buf_head  = 0;
    s->bus_buf_tail  = 0;
    s->bus_buf_count = 0;

    qemu_irq_lower(s->irq);
}

static void pic32mk_canfd_instance_init(Object *obj)
{
    PIC32MKCANFDState *s = PIC32MK_CANFD(obj);
    object_property_add_link(obj, "canbus", TYPE_CAN_BUS,
                             (Object **)&s->canbus,
                             qdev_prop_allow_set_link_before_realize,
                             0);
}

static void pic32mk_canfd_realize(DeviceState *dev, Error **errp)
{
    PIC32MKCANFDState *s = PIC32MK_CANFD(dev);

    /* SFR region (index 0) */
    memory_region_init_io(&s->sfr_mmio, OBJECT(s), &canfd_sfr_ops, s,
                          "pic32mk-canfd-sfr", PIC32MK_CAN_SFR_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->sfr_mmio);

    /* Message RAM backing store */
    s->msg_ram_buf = g_malloc0(PIC32MK_CAN_MSGRAM_SIZE);

    /* Message RAM region (index 1) — RAM-ptr so CPU can read/write freely */
    memory_region_init_ram_ptr(&s->msg_ram, OBJECT(s),
                               "pic32mk-canfd-msgram",
                               PIC32MK_CAN_MSGRAM_SIZE,
                               s->msg_ram_buf);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->msg_ram);

    sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->irq);

    /* Connect to virtual CAN bus if one was linked */
    s->bus_client.info    = &canfd_bus_client_info;
    s->bus_client.fd_mode = true;
    if (s->canbus) {
        if (can_bus_insert_client(s->canbus, &s->bus_client) < 0) {
            error_setg(errp, "pic32mk-canfd: can_bus_insert_client failed");
            return;
        }
    }
}

static void pic32mk_canfd_unrealize(DeviceState *dev)
{
    PIC32MKCANFDState *s = PIC32MK_CANFD(dev);
    can_bus_remove_client(&s->bus_client);
    g_free(s->msg_ram_buf);
    s->msg_ram_buf = NULL;
}

/*
 * Properties
 * -----------------------------------------------------------------------
 */

static const Property pic32mk_canfd_props[] = {
    DEFINE_PROP_UINT32("msg-ram-base", PIC32MKCANFDState, msg_ram_phys, 0),
    DEFINE_PROP_UINT32("instance-id", PIC32MKCANFDState, instance_id, 0),
};

/*
 * Class / type registration
 * -----------------------------------------------------------------------
 */

static void pic32mk_canfd_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize   = pic32mk_canfd_realize;
    dc->unrealize = pic32mk_canfd_unrealize;
    device_class_set_legacy_reset(dc, pic32mk_canfd_reset);
    device_class_set_props(dc, pic32mk_canfd_props);
    set_bit(DEVICE_CATEGORY_MISC, dc->categories);
    dc->desc = "Microchip PIC32MK CAN FD controller";
}

static const TypeInfo pic32mk_canfd_info = {
    .name          = TYPE_PIC32MK_CANFD,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(PIC32MKCANFDState),
    .instance_init = pic32mk_canfd_instance_init,
    .class_init    = pic32mk_canfd_class_init,
};

static void pic32mk_canfd_register_types(void)
{
    type_register_static(&pic32mk_canfd_info);
}

type_init(pic32mk_canfd_register_types)
